Repository: SyndoriaMiku/YTG-Backend
Catalog: YTG/locale/*/LC_MESSAGES/django.po
Languages: vi

source: Email is already in use
vi: Email này đã được sử dụng

source: Phone number is already in use
vi: Số điện thoại này đã được sử dụng

source: Points cannot be zero
vi: Điểm không thể là 0

source: Points earned cannot be negative
vi: Điểm thưởng không thể là âm

source: Ranking points earned cannot be negative
vi: Điểm xếp hạng không thể là âm

source: User with this username does not exist
vi: Người dùng có nickname này không tồn tại

source: User registered successfully
vi: Đăng ký thành công

source: Login successful
vi: Đăng nhập thành công

source: Invalid credentials
vi: Thông tin đăng nhập không chính xác

source: Registration failed
vi: Đăng ký thất bại

source: Refresh token is required
vi: Yêu cầu token

source: Logout successful
vi: Đăng xuất thành công

source: Invalid token
vi: Token không hợp lệ

source: You can only change your nickname once every 30 days
vi: Bạn chỉ có thể đổi tên một lần mỗi 30 ngày

source: User profile updated successfully
vi: Cập nhật thông tin người dùng thành công

source: No changes made to the profile
vi: Không có thay đổi gì

source: Error updating profile
vi: Lỗi cập nhập profile

source: Current and new passwords are required
vi: Yêu cầu mật khẩu hiện tại và mật khẩu mới

source: Current password is incorrect
vi: Mật khẩu hiện tại không chính xác

source: Password updated successfully
vi: Thay mật khẩu thành công

source: Points added successfully
vi: Thêm điểm thưởng thành công

source: Invalid data
vi: Dữ liệu không hợp lệ

source: Tournament result added successfully
vi: Kết quả thi đấu thêm thành công

source: Tournament results processed
vi: Kết quả thi đấu xử lý thành công

source: Your redemption request has been created
vi: Yêu cầu đổi thưởng của bạn đã được tạo

source: This redemption has already been processed
vi: Yêu cầu đổi thưởng của bạn đã được xử lý

source: User does not have enough points to redeem this reward
vi: Không đủ điểm để đổi thưởng

source: This reward is out of stock
vi: Phần thưởng này đã hết

source: Redemption confirmed successfully
vi: Đổi thưởng đã được xác nhận

source: This redemption cannot be cancelled
vi: Không thể hủy bỏ yêu cầu đổi thưởng này

source: Redemption cancelled successfully
vi: Hủy bỏ yêu cầu đổi thưởng thành công

source: Invalid product type
vi: Loại sản phẩm không hợp lệ

source: Insufficient stock for product
vi: Tốn kho sản phẩm không hợp lệ

source: Order created successfully
vi: Đơn hàng tạo thành công

source: Order is already cancelled
vi: Đơn hàng đã bị hủy

source: Only pending orders can be cancelled
vi: Chỉ đơn hàng đang được chờ xử lý mới có thể hủy

source: Order cancelled successfully
vi: Hủy đơn hàng thành công

source: Invalid year or month
vi: Năm tháng không hợp lệ

source: Username parameter is required
vi: Yêu cầu người dùng

source: Invalid year or month parameter
vi: Năm tháng không hợp lệ
